Revit 2024 API
SweepProfile Class
Represents a profile for sweep or swept blend elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class SweepProfile : APIObject
Visual Basic
Public Class SweepProfile _
	Inherits APIObject
Visual C++
public ref class SweepProfile : public APIObject
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.SweepProfile
 Autodesk.Revit.DB.CurveLoopsProfile
 Autodesk.Revit.DB.FamilySymbolProfile
See Also
SweepProfile Members
Autodesk.Revit.DB Namespace